backend/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (LOWER(title) LIKE '%adding%')
SELECT "tasks".* FROM "tasks" WHERE "tasks"."completed" = FALSE
SELECT "tasks".* FROM "tasks" WHERE "tasks"."completed" = TRUE AND (LOWER(title) LIKE '%task%')
---
  def index
    tasks = Task.all

    if params[:completed].present?
      completed_value = ActiveModel::Type::Boolean.new.cast(params[:completed])
      tasks = tasks.where(completed: completed_value)
    end

    if params[:search].present?
      search_term = "%#{params[:search].downcase}%"
      tasks = tasks.where("LOWER(title) LIKE ?", search_term)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 9 LIMIT 1
---
    task = Task.find(params[:id])

UPDATE "tasks" SET "title" = 'Adding a simple task! wwwww', "updated_at" = '2025-06-14 14:35:04.110422' WHERE "tasks"."id" = 70
INSERT INTO "tasks" ("title", "description", "completed", "created_at", "updated_at") VALUES ('Adding a simple task!', 'Desc', FALSE, '2025-06-14 12:52:18.615414', '2025-06-14 12:52:18.615414') RETURNING "id"
---
    task = Task.new(task_params)

    if task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 108 LIMIT 1
UPDATE "tasks" SET "description" = 'I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.I think I have seen some gems here, somewhere.', "updated_at" = '2025-06-11 14:29:54.222616' WHERE "tasks"."id" = 108
---
    task = Task.find(params[:id])

    if task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 10 LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = 10
---
    task = Task.find(params[:id])

    if task.destroy