backend/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 73 LIMIT 1
---
    task = Task.find(params[:id])

INSERT INTO "tasks" ("title", "description", "completed", "created_at", "updated_at") VALUES ('Adding a simple task!', 'Desc', FALSE, '2025-06-14 14:31:33.358655', '2025-06-14 14:31:33.358655') RETURNING "id"
---
    task = Task.new(task_params)

    if task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 70 LIMIT 1
UPDATE "tasks" SET "title" = 'Adding a simple task! www', "updated_at" = '2025-06-14 14:33:40.416911' WHERE "tasks"."id" = 70
---
        task = Task.find(task_data[:id])
        if task.update(task_data.except(:id).permit(:title, :description, :completed))

DELETE FROM "tasks" WHERE "tasks"."id" = 72
---
  def bulk_destroy_tasks
    unless params.has_key?(:ids)
      return render json: { error: 'Missing required parameters', details: 'param is missing or the value is empty or invalid: ids' }, status: :bad_request
    end

    ids = params[:ids] || []
    deleted_count = Task.where(id: ids).destroy_all.count